def f(n):
    """Возвращает  наибольший нетривиальный делитель числа,
    если число имеент ровно три нетривиальных делителя,
    в обратном случае возвращает False."""
    arr = []
    k = 0
    d = 2
    if int(n**0.25) == n**0.25:
        while d*d < n:
            if n % d == 0:
                arr.extend([d, n // d])
                k += 2
                if k > 3: return False
            d += 1
        if d*d == n: k += 1
        if k == 3: return max(arr)


for n in range(289123456, 389123456+1):
    if f(n): 
        print(n, f(n))

"""
294499921 2248091
352275361 2571353
373301041 2685619
"""