## Задача про системного администратора

Системный администратор раз в неделю создаёт архив пользовательских файлов.
Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов.
Известно, какой объём занимает файл каждого пользователя.

По заданной информации об объёме файлов пользователей и свободном объёме на
архивном диске определите максимальное число пользователей, чьи файлы можно сохранить в архиве, а
также максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что
сохранены файлы максимально возможного числа пользователей.

Входные данные.

В первой строке входного файла находятся два числа: S — размер свободного места на диске (натуральное число, не превышающее 10 000) и N — количество пользователей (натуральное число, не превышающее 1000). В следующих N строках находятся значения объёмов файлов каждого пользователя (все числа натуральные, не превышающие 100), каждое в отдельной строке.

Запишите в ответе два числа: сначала наибольшее число пользователей, чьи файлы могут быть помещены в архив, затем максимальный размер имеющегося файла, который может быть сохранён в архиве, при условии, что сохранены файлы максимально возможного числа пользователей.

Пример входного файла:
100 4
80
30
50
40

При таких исходных данных можно сохранить файлы максимум двух пользователей. Возможные объёмы этих двух файлов 30 и 40, 30 и 50 или 40 и 50. Наибольший объём файла из перечисленных пар — 50, поэтому ответ для приведённого примера: 
2 50

## Решение

Для начала, считываем данные:<br>
* s - размер свободного места на диске,
* n - количество пользователей,
* arr - архив с файлами пользователей
* res - архив с файлами, которые, в итоге, поместятся на диске
```bash
with open("input.txt") as f:
	s, n = map(int, f.readline().split())
	arr = [int(f.readline()) for i in range(n)]
	arr.sort()
	res = []
```

## Важно

Сортируем массив с файлами пользователей по возрастанию

Далее проходимся циклом по каждому файлу:
* Если файл помещается в архив, то добавляем его
* Если текущий файл не помещается, но помещается следующий файл, то удаляем текущий, и добавляем следующий
* Если архив забит полностью, то выходим из цикла
```bash
for i in range(len(arr)-1):
	if sum(res) + arr[i] <= s:
		res.append(arr[i])
	elif sum(res) - arr[i-1] + arr[i] <= s:
		del(res[-1])
		res.append(arr[i])
	else:	
		break
```

Выводим:
* len(res) - Наибольшее число пользователей, чьи файлы могут быть помещены в архив
* res[-1] - Максимальный размер сохранённого файла
```bash
print(len(res), res[-1])
```