## Х — наибольшее число, кратное 14 и являющийся произведением двух элементов последовательности

Последовательность натуральных чисел характеризуется числом Х — наибольшим числом, кратным 14 и являющимся произведением двух элементов последовательности с различными номерами. Гарантируется, что хотя бы одно такое произведение в последовательности есть.

Входные данные.

Даны два входных файла (файл A и файл B), каждый из которых содержит в первой строке количество чисел N (1 ≤ N ≤ 100000). В каждой из последующих N строк записано одно натуральное число, не превышающее 1000.

Пример организации исходных данных во входном файле:
5
40
1000
7
28
55

Пример выходных данных для приведённого выше примера входных данных: 28000

В ответе укажите два числа: сначала значение искомого произведения для файла А, затем для файла B.

[Задача на сайте Решу ЕГЭ](https://inf-ege.sdamgia.ru/problem?id=27891)

## Решение на 1 балл

Перебираем всевозможные пары чисел<br>
Находим пару чисел, произведение которой делится на 14 и при этом максимально
```bash
from itertools import combinations


with open("inputA.txt") as f:
    N = int(f.readline())
    max_X = 0
    arr = []
    for _ in range(N):
        arr.append(int(f.readline()))

    # Перебираем всевозможные пары чисел
    for a, b in combinations(arr, 2):
        if a * b % 14 == 0:
            max_X = max(max_X, a * b)
    print(max_X)
```

## Решение на 2 балла

Произведение двух чисел делится на 14, если:
* один из сомножителей делится на 14 (второй может быть любым) либо
* ни один из сомножителей не делится на 14, но один из сомножителей делится на 7, а другой – на 2.

Поэтому программа, вычисляющая число X, может работать так.

Программа читает все входные данные один раз, не запоминая все данные в массиве. Программа для прочитанного фрагмента входной последовательности хранит значения четырёх величин:
* M14 – самое большое число, кратное 14;
* М7 – самое большое число, кратное 7, но не кратное 2;
* M2 – самое большое число, кратное 2, но не кратное 7;
* МAX – самое большое число среди всех элементов последовательности, отличное от М14 (если число М14 встретилось более одного раза и оно же является максимальным, то MAX = M14).

После того как все данные прочитаны, искомое число X вычисляется как максимум из произведений М14*MAX и М7*М2.
```bash
with open("inputB.txt") as f:
    N = int(f.readline())
    arr = [int(f.readline()) for _ in range(N)]

    # Max14 - максимальное число, кратное 14
    # Max7 - максимальное число, кратное 7, но не кратное 14
    # Max2 - максимальное число, кратное 2, но не кратное 14
    # Max - максимальное число, исключая Max14
    Max14 = max(filter(lambda x: x % 14 == 0, arr), default=0)
    Max7 = max(filter(lambda x: x % 7 == 0 and x % 14 != 0, arr), default=0)
    Max2 = max(filter(lambda x: x % 2 == 0 and x % 14 != 0, arr), default=0)
    Max = max(filter(lambda x: x != Max14, arr))

    X = max(Max14 * Max, Max7 * Max2)
    print(X)
```

**Ответ: 447552 994000**